pycom/pycom-micropython-sigfox/esp32/lte/lteppp.c
/*
 * Copyright (c) 2020, Pycom Limited.
 *
 * This software is licensed under the GNU GPL version 3 or any
 * later version, with permitted additional terms. For more information
 * see the Pycom Licence v1.0 document supplied with this file, or
 * available at https://www.pycom.io/opensource/licensing
 */

#include <string.h>
#include "py/mpconfig.h"
#include "py/obj.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "esp_system.h"
#include "esp_log.h"

#include "driver/uart.h"
#include "driver/gpio.h"
#include "tcpip_adapter.h"
#include "netif/ppp/pppos.h"
#include "netif/ppp/ppp.h"
#include "netif/ppp/pppapi.h"

#include "machpin.h"
#include "lteppp.h"
#include "pins.h"
#include "mpsleep.h"
#include "esp32_mphal.h"
#include "lwip/dns.h"
#include "modlte.h"

/******************************************************************************
 DEFINE CONSTANTS
 ******************************************************************************/

#define LTE_TRX_WAIT_MS(len)                                    (((len + 1) * 12 * 1000) / MICROPY_LTE_UART_BAUDRATE)
#define LTE_TASK_PERIOD_MS                                      (2)
#define LTE_AT_CMD_TRIALS                                       (5)

/******************************************************************************
 DEFINE TYPES
 ******************************************************************************/
typedef enum
{
    LTE_PPP_IDLE = 0,
    LTE_PPP_RESUMED,
    LTE_PPP_SUSPENDED
}ltepppconnstatus_t;
/******************************************************************************
 DECLARE EXPORTED DATA
 ******************************************************************************/
extern TaskHandle_t xLTETaskHndl;
extern TaskHandle_t xLTEUartEvtTaskHndl;
SemaphoreHandle_t xLTE_modem_Conn_Sem;
/******************************************************************************
 DECLARE PRIVATE DATA
 ******************************************************************************/
static char lteppp_trx_buffer[LTE_UART_BUFFER_SIZE + 1];
#ifdef LTE_DEBUG_BUFF
static lte_log_t lteppp_log;
#endif
static char lteppp_queue_buffer[LTE_UART_BUFFER_SIZE];
static uart_dev_t* lteppp_uart_reg;
static QueueHandle_t xCmdQueue;
static QueueHandle_t xRxQueue;
static lte_state_t lteppp_lte_state;
static lte_legacy_t lteppp_lte_legacy;
static SemaphoreHandle_t xLTESem;
static ppp_pcb *lteppp_pcb;         // PPP control block
struct netif lteppp_netif;          // PPP net interface

static uint32_t lte_ipv4addr;
static uint32_t lte_gw;
static uint32_t lte_netmask;
static ip6_addr_t lte_ipv6addr;

static lte_modem_conn_state_t lteppp_modem_conn_state = E_LTE_MODEM_DISCONNECTED;

static bool ltepp_ppp_conn_up = false;

static ltepppconnstatus_t lteppp_connstatus = LTE_PPP_IDLE;

static ip_addr_t ltepp_dns_info[2]={0};

static QueueHandle_t uart0_queue;

static bool lte_uart_break_evt = false;

/******************************************************************************
 DECLARE PRIVATE FUNCTIONS
 ******************************************************************************/
static void TASK_LTE (void *pvParameters);
static void TASK_UART_EVT (void *pvParameters);
static bool lteppp_send_at_cmd_exp(const char *cmd, uint32_t timeout, const char *expected_rsp, void* data_rem, size_t len);
static bool lteppp_send_at_cmd(const char *cmd, uint32_t timeout);
static bool lteppp_check_sim_present(void);
static void lteppp_status_cb (ppp_pcb *pcb, int err_code, void *ctx);
static uint32_t lteppp_output_callback(ppp_pcb *pcb, u8_t *data, u32_t len, void *ctx);

/******************************************************************************
 DEFINE PUBLIC FUNCTIONS
 ******************************************************************************/

void connect_lte_uart (void) {

    // initialize the UART interface
    uart_config_t config;
    config.baud_rate = MICROPY_LTE_UART_BAUDRATE;
    config.data_bits = UART_DATA_8_BITS;
    config.parity = UART_PARITY_DISABLE;
    config.stop_bits = UART_STOP_BITS_1;
    config.flow_ctrl = UART_HW_FLOWCTRL_CTS_RTS;
    config.rx_flow_ctrl_thresh = 64;
    config.use_ref_tick = false;
    uart_param_config(LTE_UART_ID, &config);

    // configure the UART pins
    pin_config(MICROPY_LTE_TX_PIN, -1, U2TXD_OUT_IDX, GPIO_MODE_OUTPUT, MACHPIN_PULL_NONE, 1);
    pin_config(MICROPY_LTE_RX_PIN, U2RXD_IN_IDX, -1, GPIO_MODE_INPUT, MACHPIN_PULL_NONE, 1);
    pin_config(MICROPY_LTE_RTS_PIN, -1, U2RTS_OUT_IDX, GPIO_MODE_OUTPUT, MACHPIN_PULL_NONE, 1);
    pin_config(MICROPY_LTE_CTS_PIN, U2CTS_IN_IDX, -1, GPIO_MODE_INPUT, MACHPIN_PULL_NONE, 1);

    vTaskDelay(5 / portTICK_RATE_MS);

    uart_set_hw_flow_ctrl(LTE_UART_ID, UART_HW_FLOWCTRL_DISABLE, 0);

    // install the UART driver
    uart_driver_install(LTE_UART_ID, LTE_UART_BUFFER_SIZE, LTE_UART_BUFFER_SIZE, 1, &uart0_queue, 0, NULL);
    lteppp_uart_reg = &UART2;

    // disable the delay between transfers
    lteppp_uart_reg->idle_conf.tx_idle_num = 0;

    // configure the rx timeout threshold
    lteppp_uart_reg->conf1.rx_tout_thrhd = 20 & UART_RX_TOUT_THRHD_V;

    uart_set_rts(LTE_UART_ID, false);

    xTaskCreatePinnedToCore(TASK_UART_EVT, "LTE_UART_EVT", 2048 / sizeof(StackType_t), NULL, 12, &xLTEUartEvtTaskHndl, 1);
}


void lteppp_init(void) {
    lteppp_lte_state = E_LTE_INIT;

    xCmdQueue = xQueueCreate(LTE_CMD_QUEUE_SIZE_MAX, sizeof(lte_task_cmd_data_t));
    xRxQueue = xQueueCreate(LTE_RSP_QUEUE_SIZE_MAX, LTE_AT_RSP_SIZE_MAX + 1);

    xLTESem = xSemaphoreCreateMutex();
    xLTE_modem_Conn_Sem = xSemaphoreCreateMutex();

    lteppp_pcb = pppapi_pppos_create(&lteppp_netif, lteppp_output_callback, lteppp_status_cb, NULL);

    //wait on connecting modem until it is allowed
    lteppp_modem_conn_state = E_LTE_MODEM_DISCONNECTED;

    xTaskCreatePinnedToCore(TASK_LTE, "LTE", LTE_TASK_STACK_SIZE / sizeof(StackType_t), NULL, LTE_TASK_PRIORITY, &xLTETaskHndl, 1);

    lteppp_connstatus = LTE_PPP_IDLE;
#ifdef LTE_DEBUG_BUFF
    lteppp_log.log = heap_caps_malloc(LTE_LOG_BUFF_SIZE, MALLOC_CAP_SPIRAM);
#endif
}

void lteppp_start (void) {
    uart_set_hw_flow_ctrl(LTE_UART_ID, UART_HW_FLOWCTRL_CTS_RTS, 64);
    vTaskDelay(5);
}
#ifdef LTE_DEBUG_BUFF
char* lteppp_get_log_buff(void)
{
    if(lteppp_log.truncated)
    {
        if(lteppp_log.ptr < LTE_LOG_BUFF_SIZE - strlen("\n********BUFFER WRAPAROUND********\n") - 1)
        {
            memcpy(&(lteppp_log.log[lteppp_log.ptr]), "\n********BUFFER WRAPAROUND********\n", strlen("\n********BUFFER WRAPAROUND********\n"));
            lteppp_log.ptr += strlen("\n********BUFFER WRAPAROUND********\n");
        }
        lteppp_log.log[LTE_LOG_BUFF_SIZE - 1] = '\0';
    }
    else
    {
        lteppp_log.log[lteppp_log.ptr] = '\0';
    }
    return lteppp_log.log;
}
#endif
lte_modem_conn_state_t lteppp_modem_state(void)
{
    lte_modem_conn_state_t state;
    xSemaphoreTake(xLTESem, portMAX_DELAY);
    state = lteppp_modem_conn_state;
	xSemaphoreGive(xLTESem);
	return state;
}

void lteppp_set_state(lte_state_t state) {
    xSemaphoreTake(xLTESem, portMAX_DELAY);
    lteppp_lte_state = state;
    xSemaphoreGive(xLTESem);
}

void lteppp_set_default_inf(void)
{
    pppapi_set_default(lteppp_pcb);
    //Restore DNS
    dns_setserver(0, &(ltepp_dns_info[0]));
    dns_setserver(1, &(ltepp_dns_info[1]));
}

void lteppp_set_legacy(lte_legacy_t legacy) {
    xSemaphoreTake(xLTESem, portMAX_DELAY);
    lteppp_lte_legacy = legacy;
    xSemaphoreGive(xLTESem);
}

void lteppp_connect (void) {
    uart_flush(LTE_UART_ID);
    vTaskDelay(25);
    pppapi_set_default(lteppp_pcb);
    ppp_set_usepeerdns(lteppp_pcb, 1);
    pppapi_set_auth(lteppp_pcb, PPPAUTHTYPE_PAP, "", "");
    pppapi_connect(lteppp_pcb, 0);
    lteppp_connstatus = LTE_PPP_IDLE;
}

void lteppp_disconnect(void) {
    pppapi_close(lteppp_pcb, 0);
    vTaskDelay(150);
    lteppp_connstatus = LTE_PPP_IDLE;
}

void lteppp_send_at_command (lte_task_cmd_data_t *cmd, lte_task_rsp_data_t *rsp) {
    xQueueSend(xCmdQueue, (void *)cmd, (TickType_t)portMAX_DELAY);
    xQueueReceive(xRxQueue, rsp, (TickType_t)portMAX_DELAY);
}

bool lteppp_wait_at_rsp (const char *expected_rsp, uint32_t timeout, bool from_mp, void* data_rem) {

