pycom/pycom-micropython-sigfox/esp32/lte/lteppp.c
    uint32_t rx_len = 0;
    uint32_t timeout_cnt = timeout;
    // wait until characters start arriving
    do {
        // being called from the MicroPython interpreter
        if (from_mp) {
            mp_hal_delay_ms(1);
        }
        else {
            vTaskDelay(1 / portTICK_RATE_MS);
        }
        uart_get_buffered_data_len(LTE_UART_ID, &rx_len);
        if (timeout_cnt > 0) {
            timeout_cnt--;
        }
    } while (timeout_cnt > 0 && 0 == rx_len);

    memset(lteppp_trx_buffer, 0, LTE_UART_BUFFER_SIZE);
    uint16_t len_count = 0;

    while (rx_len > 0) {
        if (len_count == 0) {
            // try to read up to the size of the buffer minus null terminator (minus 2 because we store the OK status in the last byte)
            rx_len = uart_read_bytes(LTE_UART_ID, (uint8_t *)lteppp_trx_buffer, LTE_UART_BUFFER_SIZE - 2, LTE_TRX_WAIT_MS(LTE_UART_BUFFER_SIZE) / portTICK_RATE_MS);
        }
        else
        {
            // try to read up to the size of the buffer minus null terminator (minus 2 because we store the OK status in the last byte)
            rx_len = uart_read_bytes(LTE_UART_ID, (uint8_t *)(&(lteppp_trx_buffer[len_count])), LTE_UART_BUFFER_SIZE - len_count - 2, LTE_TRX_WAIT_MS(LTE_UART_BUFFER_SIZE) / portTICK_RATE_MS);
        }
        len_count += rx_len;

        if (rx_len > 0) {
            // NULL terminate the string
            lteppp_trx_buffer[len_count] = '\0';
#ifdef LTE_DEBUG_BUFF
            if (lteppp_log.ptr < LTE_LOG_BUFF_SIZE - rx_len) {
                if (len_count == rx_len) {
                    memcpy(&(lteppp_log.log[lteppp_log.ptr]), "[RSP]: ", strlen("[RSP]: "));
                    lteppp_log.ptr += strlen("[RSP]: ");
                }
                memcpy(&(lteppp_log.log[lteppp_log.ptr]), lteppp_trx_buffer, rx_len);
                lteppp_log.ptr += rx_len;
                lteppp_log.log[lteppp_log.ptr] = '\n';
                lteppp_log.ptr++;
            }
            else
            {
                lteppp_log.ptr = 0;
                lteppp_log.truncated = true;
            }
#endif

            if (expected_rsp != NULL) {
                if (strstr(lteppp_trx_buffer, expected_rsp) != NULL) {
                    //printf("RESP: %s\n", lteppp_trx_buffer);
                    return true;
                }
            }

            uart_get_buffered_data_len(LTE_UART_ID, &rx_len);

            if((len_count + rx_len) >= (LTE_UART_BUFFER_SIZE - 2))
            {
                if (data_rem != NULL) {
                    *((bool *)data_rem) = true;
                    return true;
                }
            }
            else if(rx_len == 0)
            {
                uint8_t timeout_buff = 10;
                while((!strstr(lteppp_trx_buffer,"\r\nOK\r\n")) && (!strstr(lteppp_trx_buffer,"\r\nERROR\r\n")) && (!strstr(lteppp_trx_buffer,"+SYSSTART")) && (!strstr(lteppp_trx_buffer,"\r\nCONNECT\r\n")) &&
                        rx_len == 0 && timeout_buff > 0)
                {
#ifdef LTE_DEBUG_BUFF
                    memcpy(&(lteppp_log.log[lteppp_log.ptr]), "[Waiting]:\n", strlen("[Waiting]:\n"));
                    lteppp_log.ptr += strlen("[Waiting]:\n");
#endif

                    uart_get_buffered_data_len(LTE_UART_ID, &rx_len);

                    if (from_mp) {
                        mp_hal_delay_ms(100);
                    }
                    else {
                        vTaskDelay(100 / portTICK_RATE_MS);
                    }
                    timeout_buff--;
                }
                //check size again
                if((len_count + rx_len) >= (LTE_UART_BUFFER_SIZE - 2))
                {
                    if (data_rem != NULL) {
                        *((bool *)data_rem) = true;
                        return true;
                    }
                }
            }
        }
        else
        {
            // Do Nothing
        }
    }
    if (data_rem != NULL) {
        *((bool *)data_rem) = false;
    }
    return false;
}

lte_state_t lteppp_get_state(void) {
    lte_state_t state;
    xSemaphoreTake(xLTESem, portMAX_DELAY);
    state = lteppp_lte_state;
    xSemaphoreGive(xLTESem);
    return state;
}

lte_legacy_t lteppp_get_legacy(void) {
    lte_legacy_t legacy;
    xSemaphoreTake(xLTESem, portMAX_DELAY);
    legacy = lteppp_lte_legacy;
    xSemaphoreGive(xLTESem);
    return legacy;
}

void lteppp_deinit (void) {

    uart_set_hw_flow_ctrl(LTE_UART_ID, UART_HW_FLOWCTRL_DISABLE, 0);
    uart_set_rts(LTE_UART_ID, false);
    xSemaphoreTake(xLTESem, portMAX_DELAY);
    lteppp_lte_state = E_LTE_INIT;
    lteppp_modem_conn_state = E_LTE_MODEM_DISCONNECTED;
	xSemaphoreGive(xLTESem);
}

uint32_t lteppp_ipv4(void) {
    return lte_ipv4addr;
}

bool ltepp_is_ppp_conn_up(void)
{
	return ltepp_ppp_conn_up;
}

void lteppp_suspend(void)
{
    lteppp_connstatus = LTE_PPP_SUSPENDED;
}

void lteppp_resume(void)
{
    lteppp_connstatus = LTE_PPP_RESUMED;
}
/******************************************************************************
 DEFINE PRIVATE FUNCTIONS
 ******************************************************************************/
static void TASK_LTE (void *pvParameters) {
    bool sim_present;
    lte_task_cmd_data_t *lte_task_cmd = (lte_task_cmd_data_t *)lteppp_trx_buffer;
    lte_task_rsp_data_t *lte_task_rsp = (lte_task_rsp_data_t *)lteppp_trx_buffer;
    uint8_t at_trials = 0;
    static uint32_t thread_notification;

    connect_lte_uart();

modem_init:

    thread_notification = ulTaskNotifyTake(pdTRUE, portMAX_DELAY);

    if (thread_notification)
    {
        xSemaphoreTake(xLTE_modem_Conn_Sem, portMAX_DELAY);
        xSemaphoreTake(xLTESem, portMAX_DELAY);
        lteppp_modem_conn_state = E_LTE_MODEM_CONNECTING;
        xSemaphoreGive(xLTESem);
        uart_set_rts(LTE_UART_ID, true);
        vTaskDelay(500/portTICK_PERIOD_MS);
        uart_set_hw_flow_ctrl(LTE_UART_ID, UART_HW_FLOWCTRL_CTS_RTS, 64);
        // exit PPP session if applicable
        if(lteppp_send_at_cmd("+++", LTE_PPP_BACK_OFF_TIME_MS))
        {
            vTaskDelay(LTE_PPP_BACK_OFF_TIME_MS / portTICK_RATE_MS);
            while(!lteppp_send_at_cmd("AT", LTE_RX_TIMEOUT_MIN_MS))
            {
                if (at_trials >= LTE_AT_CMD_TRIALS) {
                    uart_set_hw_flow_ctrl(LTE_UART_ID, UART_HW_FLOWCTRL_DISABLE, 0);
                    uart_set_rts(LTE_UART_ID, false);
                    xSemaphoreTake(xLTESem, portMAX_DELAY);
                    lteppp_modem_conn_state = E_LTE_MODEM_DISCONNECTED;
                    xSemaphoreGive(xLTESem);
                    xSemaphoreGive(xLTE_modem_Conn_Sem);
                    at_trials = 0;
                    goto modem_init;
                }
                at_trials++;
            }
        }
        else
        {
            lteppp_send_at_cmd("AT", LTE_RX_TIMEOUT_MIN_MS);
            if (!lteppp_send_at_cmd("AT", LTE_RX_TIMEOUT_MIN_MS)) {
                vTaskDelay(LTE_PPP_BACK_OFF_TIME_MS / portTICK_RATE_MS);
                if (lteppp_send_at_cmd("+++", LTE_PPP_BACK_OFF_TIME_MS))
                {
                    while(!lteppp_send_at_cmd("AT", LTE_RX_TIMEOUT_MIN_MS))
                    {
                        if (at_trials >= LTE_AT_CMD_TRIALS) {
                            uart_set_hw_flow_ctrl(LTE_UART_ID, UART_HW_FLOWCTRL_DISABLE, 0);
                            uart_set_rts(LTE_UART_ID, false);
                            xSemaphoreTake(xLTESem, portMAX_DELAY);
                            lteppp_modem_conn_state = E_LTE_MODEM_DISCONNECTED;
                            xSemaphoreGive(xLTESem);
                            xSemaphoreGive(xLTE_modem_Conn_Sem);
                            at_trials = 0;
                            goto modem_init;
                        }
                        at_trials++;
                    }
                }
                else
                {
                    while(!lteppp_send_at_cmd("AT", LTE_RX_TIMEOUT_MIN_MS))
                    {
                        if (at_trials >= LTE_AT_CMD_TRIALS) {
                            uart_set_hw_flow_ctrl(LTE_UART_ID, UART_HW_FLOWCTRL_DISABLE, 0);
                            uart_set_rts(LTE_UART_ID, false);
                            xSemaphoreTake(xLTESem, portMAX_DELAY);
                            lteppp_modem_conn_state = E_LTE_MODEM_DISCONNECTED;
                            xSemaphoreGive(xLTESem);
                            xSemaphoreGive(xLTE_modem_Conn_Sem);
                            at_trials = 0;
                            goto modem_init;
                        }
                        at_trials++;
                    }
                }
            }
        }
        at_trials = 0;
        // Disable char echo
        lteppp_send_at_cmd("ATE0", LTE_RX_TIMEOUT_MIN_MS);
        // disable PSM if enabled by default
        lteppp_send_at_cmd("AT+CPSMS=0", LTE_RX_TIMEOUT_MIN_MS);

        // at least enable access to the SIM
        lteppp_send_at_cmd("AT+CFUN?", LTE_RX_TIMEOUT_MAX_MS);
        char *pos = strstr(lteppp_trx_buffer, "+CFUN: ");
        if (pos && (pos[7] != '1') && (pos[7] != '4')) {
            lteppp_send_at_cmd("AT+CFUN=4", LTE_RX_TIMEOUT_MAX_MS);
        }
        // check for SIM card inserted
        sim_present = lteppp_check_sim_present();

